Revit 2027 API
SpatialElementTag.Location Property
The location of the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override Location Location { get; }
Public Overrides ReadOnly Property Location As Location
	Get
public:
virtual property Location^ Location {
	Location^ get () override;
}
abstract Location : Location with get
override Location : Location with get
Property Value
Location
Remarks
Allows you to get and set the location of the tag within the level. The Z location should be the elevation of the level and is not changeable.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace